_posts/2014-09-19-A-parcel-full-of-vitamins.html
---
layout: post
title:  A parcel full of vitamins
date:   2014-09-19T22:28:15+0200
---

<p>
Today I received the parcel I had ordered at Gadgets3D. However, they
have web stores that deliver to EU and worldwide with prices in Euro
and US dollars, respectively, they are Polish company and if you ask
them they are willing to charge you in złoty and avoid additional
exchange cost. In the parcel there were pieces of <a href="http://gadgets3d.com/index.php?route=product/product&path=62&product_id=87">RAMPS 1.4. STARTER
SET</a> and a spool of <a href="http://gadgets3d.eu/index.php?route=product/product&path=60&product_id=98">orange PLA</a>. I've got yet to find out in practice
but the set seems to be more than enough to build my machine.
</p>

<p>
In the parcel I found
</p>

<ul class="org-ul">
<li>RAMPS on an ATmega2560 CPU board<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>
</li>
<li>MicroSD slot.
</li>
<li>LCD+SD panel with a rotary encoder
</li>
<li>Five NEMA17 motors<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>
</li>
<li>Cooling plate, an acrylic frame with two 50mm fans and a set of
mounting screws and nylon stand-offs.
</li>
<li>G3D hot end based on Budaschnozzle 1.1
</li>
<li>1.75 mm and 3 mm PTFE tubes.
</li>
<li>0.5 and 0.4 nozzles
</li>
<li>3.6m of 6mm wide GT2 timing belt.
</li>
<li>Two pulleys with for locking screws and an appropriate hex key.
</li>
<li>Nine end-stops:
<ul class="org-ul">
<li>three magnetic (hall effect) with three magnets
</li>
<li>three mechanical (me1 style), mounted on PCBs with RC filters and LEDs,
</li>
<li>three ordinary 5 amp micro switches with lever and rollers.
</li>
</ul>
</li>
<li>Fan splitter, a PCB with a bunch of connectors to plug fans in.
</li>
<li>40 mm fan.
</li>
<li>50 mm fan.
</li>
<li>Hobbed bolt.
</li>
<li>Four thermistors.
</li>
<li>MK2a heatbed.
</li>
<li>A bunch of cables with connectors crimped on one end of each.
</li>
<li>A roll of 50 mm wide kapton tape.
</li>
<li>Six springs.
</li>
<li>Four bulldog paper clips.
</li>
<li>Japanese ceramic screw driver for tuning step-sticks.
</li>
<li>A roll of PTFE tape.
</li>
<li>4GB SD card.
</li>
</ul>

<p>
Other vitamins I know I will need are:
</p>

<ul class="org-ul">
<li>smooth rods,
</li>
<li>threaded rod,
</li>
<li>the frame,
</li>
<li>nuts and bolts.
</li>
</ul>

<p>
This means it should be possible to build the machine under 500 €.
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
Sadly it's a fake Arduiono, however guys at G3D haven't claimed
it is genuine.
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
I've got no experience with such motors. In case of most DC
motors connecting their leads together makes it hard to turn a
shaft. In case of these I cant turn a shaft at all. This means
the winding resistance is very low, good thing.
</p></div>


</div>
</div>
